app/Http/Controllers/PostController.php

select * from `posts` where `slug` = 'chrome-extension' limit 1
select * from `comments` where `comments`.`post_id` = 11 and `comments`.`post_id` is not null and `parent_id` = 0 order by `created_at` desc
select * from `comments` where `comments`.`post_id` = 11 and `comments`.`post_id` is not null and `parent_id` > 0
---
    public function showSingle($slug, Request $request)
    {
        $return = array();
        $post = Post::where('slug', $slug)->first();
        $comments = $post->comments()
            ->where('parent_id', 0)
            ->orderBy('created_at', 'DESC')
            ->get();

        $children = $post->comments()
            ->where('parent_id', '>', 0)
            ->get();

select * from `posts` order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `posts`
select * from `categories` where `slug` = 'it' limit 1
---
    public function showCategory($category = NULL)
    {
        if($category == self::ALL_NEWS || $category == NULL)
        {
            $posts = Post::orderBy('created_at', 'DESC')->paginate(6);
            return view('posts.all-paginate', ['posts' => $posts]);
        }

        $category = Category::where('slug', $category)
            ->first();